app/views/books/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "book_tags" ON "tags"."id" = "book_tags"."tag_id" WHERE "book_tags"."book_id" = ?  [["book_id", 2]]
---
          <td>
            <% @book.tags.each do |tag| %>