app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
SELECT "books".* FROM "books" ORDER BY "star" DESC
---
  def index
    @books = Book.all
    @book = Book.new
     if params[:latest]
       @books = Book.latest
     elsif params[:old]
       @books = Book.old
     elsif params[:star_count]
       @books = Book.star_count
     else
        @books = Book.all

INSERT INTO "books" ("rate", "title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rate", 4.5], ["title", "tst1"], ["body", "aaa"], ["user_id", 1], ["created_at", "2022-06-06 08:28:08.281696"], ["updated_at", "2022-06-06 08:28:08.281696"]]
INSERT INTO "book_tags" ("book_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["book_id", 2], ["tag_id", 1], ["created_at", "2022-06-06 08:28:08.324629"], ["updated_at", "2022-06-06 08:28:08.324629"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "aaa"], ["created_at", "2022-06-06 08:28:08.309008"], ["updated_at", "2022-06-06 08:28:08.309008"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    tag_list = params[:book][:tag_name].split(',')
    if @book.save
      @book.save_tags(tag_list)
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all