app/models/tag.rb

  def self.search_books_for(content, method)

    if method == 'perfect'
      tags = Tag.where(name: content)
    elsif method == 'forward'
      tags = Tag.where('name LIKE ?', content + '%')
    elsif method == 'backward'
      tags = Tag.where('name LIKE ?', '%' + content)
    else
      tags = Tag.where('name LIKE ?', '%' + content + '%')
---
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ?  [["name", "aaa"]]